---
kind: method
id: M:Autodesk.Revit.DB.ParameterDownloadOptions.#ctor
source: html/00df3460-4cd7-7dee-bae3-5f70fa822f38.htm
---
# Autodesk.Revit.DB.ParameterDownloadOptions.#ctor Method

Default constructor.

## Syntax (C#)
```csharp
public ParameterDownloadOptions()
```